app/controllers/admin/customers_controller.rb

  def index
    @customers = Customer.order(:id)
---
SELECT `customers`.* FROM `customers`   ORDER BY `customers`.`id` ASC

  def create
    @customer = Customer.new(customer_params)
    if @customer.save
---
INSERT INTO `customers` (`abbreviation`, `created_at`, `name`, `updated_at`) VALUES ('ssss', '2016-04-16 07:19:50', 'test', '2016-04-16 07:19:50')

    def edit
    @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1

  def update
    @customer = Customer.find(params[:id])
    @customer.assign_attributes(customer_params)
    if @customer.save
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 3 LIMIT 1
UPDATE `customers` SET `name` = '日本コンラックス1yo', `updated_at` = '2016-04-10 07:53:39' WHERE `customers`.`id` = 3

  def destroy
    customer = Customer.find(params[:id])
    name = customer.name

    if ProductItem.exists?(id: customer.id)
      flash.alert = '機種が登録されています、削除できません'
    else
      customer.destroy!
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 4 LIMIT 1
SELECT  1 AS one FROM `product_items`  WHERE `product_items`.`name` = 'fffffffffff' LIMIT 1
SELECT `product_items`.* FROM `product_items`  WHERE `product_items`.`customer_id` = 4
DELETE FROM `customers` WHERE `customers`.`id` = 4
DELETE FROM `product_items` WHERE `product_items`.`id` = 29