app/controllers/admin/maketag_controller.rb

SELECT  `product_items`.* FROM `product_items`  WHERE `product_items`.`id` = 1 LIMIT 1
---
  def confirm

    @product = ProductItem.find(params[:customer][:id])