app/controllers/admin/product_items_controller.rb

SELECT `product_items`.* FROM `product_items`   ORDER BY `product_items`.`customer_id` ASC, `product_items`.`name` ASC
SELECT `customers`.* FROM `customers`  WHERE `customers`.`id` IN (1, 2, 3)
SELECT `product_items`.* FROM `product_items`   ORDER BY `product_items`.`name` ASC
SELECT  `product_items`.* FROM `product_items`   ORDER BY `product_items`.`customer_id` ASC, `product_items`.`name` ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `product_items`
---
  def index
    @product_items = ProductItem.order(:customer_id, :name)
    @product_items = @product_items.includes(:customer)
    @product_items = @product_items.page(params[:page])

SELECT  `product_items`.* FROM `product_items`  WHERE `product_items`.`id` = 0 LIMIT 1
---
  def show
    product_items = ProductItem.find(params[:id])

INSERT INTO `product_items` (`created_at`, `customer_id`, `name`, `qrcode`, `updated_at`, `use_pokanon`) VALUES ('2016-04-10 06:42:25', 1, 'fffffffffffffffffff', 'ffffffffffffffffffffffffffffgah', '2016-04-10 06:42:25', 1)
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
---
  def create
    @product_item = ProductItem.new(product_item_params)
    if @product_item.save
      flash.notice = Customer.find(@product_item.customer_id).name + "に" + @product_item.name + 'を登録しました'

SELECT  `product_items`.* FROM `product_items`  WHERE `product_items`.`id` = 25 LIMIT 1
DELETE FROM `product_items` WHERE `product_items`.`id` = 25
---
  def destroy
    product_item = ProductItem.find(params[:id])
    name = product_item.name
    product_item.destroy!

SELECT  `product_items`.* FROM `product_items`  WHERE `product_items`.`id` = 23 LIMIT 1
---
  def edit
    @product_item = ProductItem.find(params[:id])

SELECT  `product_items`.* FROM `product_items`  WHERE `product_items`.`id` = 10 LIMIT 1
UPDATE `product_items` SET `name` = 'VT-20 SW', `qrcode` = 'VT-20 SW', `updated_at` = '2016-04-10 07:50:34' WHERE `product_items`.`id` = 10
---
  def update
    @product_item = ProductItem.find(params[:id])
    @product_item.assign_attributes(product_item_params)
    if @product_item.save

SELECT `product_items`.* FROM `product_items`
SELECT `customers`.* FROM `customers`
---
  def download
    @product_items = ProductItem.all
    @customers = Customer.all