app/views/admin/product_items/_form.html.erb

  <%= f.label :customer_id, '客先' %>
  <%= f.collection_select :customer_id, Customer.all, :id, :name %>
---
SELECT  `customers`.* FROM `customers`   ORDER BY `customers`.`id` ASC LIMIT 1