app/views/admin/maketag/_product_select.erb

SELECT `product_items`.* FROM `product_items`  WHERE `product_items`.`customer_id` IS NULL
---
<%= collection_select :customer, :id, ProductItem.where(customer_id: product_id), :id, :name %>