app/views/admin/maketag/_product_select2.erb

<%= collection_select "customer2", :id, ProductItem.where(customer_id: product_id), :id, :name %>
---
SELECT `product_items`.* FROM `product_items`  WHERE `product_items`.`customer_id` IS NULL