app/views/admin/maketag/index.html.erb

SELECT `customers`.* FROM `customers`  WHERE (`customers`.`id` NOT IN (1, 3, 2))
---
        <%= f.label :customer, '客先' %><br />
        <%= f.collection_select :customer, Customer.where(id: ProductItem.all.index_by(&:customer_id).keys), :id, :name %>

SELECT  `customers`.* FROM `customers`   ORDER BY `customers`.`id` ASC LIMIT 1
---
        <div class="field" id="target1" >
        <%= render partial: 'product_select', locals: { product_id: Customer.first.id } %>